Repository: minicoursedev/aibox-mac
Catalog: Localizations/Localizable.xcstrings
Source language: en
Languages: zh_hant

source: Codex will send the conversation ID, turn ID, and final response, permission request, or questions and options to local AIBox. This program only receives notifications. It does not answer questions, approve or deny permissions, or request continuation.
zh_hant: Codex 將把對話 ID、輪次 ID，以及最後回覆、授權請求或問題與選項傳給本機 AIBox。此程式只接收通知，不代答問題、不同意或拒絕授權，不要求續跑。

source: · %@ confirmed
zh_hant: · %@已確認

source: %.1f s
zh_hant: %.1f 秒

source: %@ %@ Conversation: %@ Click to open this conversation
zh_hant: %@ %@ 對話：%@ 點擊開啟此對話

source: %@ cleared its pairing, but macOS still has the old pairing. In System Settings → Bluetooth, choose Forget This Device for AIBox, then return, click Search Again and confirm the light color.
zh_hant: %@ 已清除配對，但 macOS 仍保留舊配對。請在「系統設定 → 藍牙」對 AIBox 選擇「忘記此裝置設定」，再回來按「重新搜尋」並確認燈色。

source: %@ color %@
zh_hant: %@顏色%@

source: AIBox Settings
zh_hant: AIBox 設定

source: AIBox communication characteristics do not match.
zh_hant: AIBox 通訊特徵不符。

source: AIBox communication service not found.
zh_hant: 找不到 AIBox 通訊服務。

source: AIBox could not start
zh_hant: AIBox 無法啟動

source: AIBox has stopped.
zh_hant: AIBox 已停止。

source: AIBox is already running.
zh_hant: AIBox 已經在執行。

source: AIBox: Running
zh_hant: AIBox：執行中

source: AIBox: Running %@
zh_hant: AIBox：執行中 %@

source: Above threshold
zh_hant: 音量高於拉桿

source: Alternating
zh_hant: 兩色交替

source: Awaiting answer
zh_hant: 等待回答

source: Awaiting trust / activation
zh_hant: 待信任／啟用

source: Below threshold
zh_hant: 音量低於拉桿

source: Blue
zh_hant: 藍色

source: Bluetooth access denied. Allow AIBox to use Bluetooth in System Settings.
zh_hant: 未獲藍牙權限；請在系統設定允許 AIBox 使用藍牙。

source: Cancel
zh_hant: 取消

source: Choose / Change Device…
zh_hant: 選擇／更換裝置…

source: Choose AIBox
zh_hant: 選擇 AIBox

source: Choose a box, observe its flashing color, then select the color you see. After confirmation, this Mac will remember and reconnect only to that box.
zh_hant: 選一台 box，觀察它閃爍的顏色，再選出你看到的顏色。確認後，這台 Mac 會記住並只連回這台 box。

source: Choose motion or sound to open notifications, and adjust the sound threshold live.
zh_hant: 選擇用晃動或聲音開啟通知，並即時調整收音。

source: Choose the display language for AIBox.
zh_hant: 選擇 AIBox 的顯示語系。

source: Click Identify Again and confirm the color.
zh_hant: 請按「重新辨識」再確認顏色。

source: Click a swatch to open the color wheel. Colors are saved automatically and applied when connected.
zh_hant: 點色塊開啟色環；顏色自動儲存，連線後套用至對應燈號。

source: Click to choose %@ color %@ using the color wheel
zh_hant: 點擊以色環選擇%@顏色%@

source: Codex App or aibox-notify was not found. Check the installation and build.
zh_hant: 找不到 Codex App 或 aibox-notify，請確認安裝與建置結果。

source: Codex configuration executable not found. Make sure Codex App is installed.
zh_hant: 找不到 Codex 設定程式，請確認 Codex App 已安裝。

source: Codex could not load hooks. Check the existing hook settings first.
zh_hant: Codex 無法載入 Hooks，請先檢查既有 Hooks 設定。

source: Codex hooks are disabled. AIBox did not change this setting.
zh_hant: Codex 的 hooks 功能已停用；AIBox 未更改此設定。

source: Codex settings have not been checked.
zh_hant: 尚未檢查 Codex 設定。

source: Codex setup failed: %@
zh_hant: Codex 設定失敗：%@

source: Codex setup timed out. Reopen Settings to check the result.
zh_hant: Codex 設定操作逾時，請重新開啟設定視窗確認結果。

source: Color interval
zh_hant: 交替間隔

source: Color interval, seconds per color
zh_hant: 交替間隔，每個顏色顯示秒數

source: Configured and trusted
zh_hant: 已設定並信任

source: Connected to %@; waiting for remote hook notifications.
zh_hant: 已連線至 %@；等待遠端 Hook 通知。

source: Connecting to %@…
zh_hant: 正在連線至 %@…

source: Connection failed.
zh_hant: 連線失敗。

source: Connection timed out.
zh_hant: 連線逾時。

source: Could Not Open Conversation
zh_hant: 無法開啟對話

source: Could not establish secure pairing. Reconnect and try again.
zh_hant: 無法建立安全配對，請重新連線。

source: Could not read the Codex settings response. Setup success is unconfirmed.
zh_hant: 無法讀取 Codex 的設定回應，未確認設定成功。

source: Could not save notification payload: %@
zh_hant: 無法保存通知 payload：%@

source: Could not subscribe to device events.
zh_hant: 無法訂閱裝置事件。

source: Current level %@
zh_hant: 目前音量 %@

source: Detect Motion
zh_hant: 偵測晃動

source: Detect Sound
zh_hant: 偵測聲音

source: Device
zh_hant: 裝置

source: Device accelerometer initialization failed
zh_hant: 裝置的加速度計初始化失敗

source: Device authorization has not completed.
zh_hant: 裝置尚未完成授權確認。

source: Device command was not acknowledged.
zh_hant: 裝置指令未獲確認。

source: Device could not apply blink interval
zh_hant: 裝置無法套用閃燈間隔

source: Device could not apply light colors
zh_hant: 裝置無法套用燈號顏色

source: Device does not support this command. Update the box firmware.
zh_hant: 裝置不支援目前指令，請更新 box 韌體。

source: Device firmware version mismatch
zh_hant: 裝置韌體版本不符

source: Device microphone initialization failed
zh_hant: 裝置的麥克風初始化失敗

source: Disconnect
zh_hant: 斷線

source: Disconnected
zh_hant: 已斷線

source: Disconnected; retrying in %@ seconds.
zh_hant: 連線中斷，%@ 秒後重試。

source: Drag the white thumb to compare with the current level. The bar turns orange when the level exceeds the thumb.
zh_hant: 拖曳白色拉桿比對目前音量；音量超過拉桿位置時立即轉橘色。

source: Encrypted Bluetooth connection is incomplete. Allow pairing if prompted.
zh_hant: 藍牙加密連線尚未完成；若系統要求配對，請允許。

source: Enter an SSH host alias, such as srv, without spaces or connection options.
zh_hant: 請輸入 SSH 主機別名，例如 srv；不含空白或連線參數。

source: Event: %@ Command: %@
zh_hant: 事件：%@ 程式：%@

source: Failed to read device events.
zh_hant: 讀取裝置事件失敗。

source: Failed to send command.
zh_hant: 傳送指令失敗。

source: First remove the old pairing saved by macOS.
zh_hant: 請先清除 macOS 保留的舊配對。

source: General
zh_hant: 一般

source: Green
zh_hant: 綠色

source: Hook definition changed. Check it again and confirm trust.
zh_hant: Hook 定義已變更，請重新檢查並確認信任。

source: Hooks run only after you confirm trust. Reopen your Codex conversation after setup; restart Codex if the hooks have not loaded. Keep AIBox running and click a notification to open its conversation. Stop marks stop processing; other hooks may still request continuation.
zh_hant: Hook 需確認信任後才會執行。設定後請重新開啟 Codex 對話；若尚未載入，請自行重啟 Codex。保持 AIBox 執行，收到通知後點擊該筆即可開啟對應對話。Stop 表示進入停止處理；其他 Hook 仍可能要求續跑。

source: I see %@
zh_hant: 我看到%@

source: Identify
zh_hant: 辨識這台

source: Identify Again
zh_hant: 重新辨識

source: Identify Your AIBox
zh_hant: 確認你的 AIBox

source: Idle
zh_hant: 待機

source: Idle light
zh_hant: 待機燈號

source: In %@d %@h
zh_hant: %@天%@小時後

source: In %@h %@m
zh_hant: %@小時%@分後

source: In %@m
zh_hant: %@分後

source: Invalid notification format; type, thread-id and turn-id are required.
zh_hant: 通知格式不符，需包含 type、thread-id 與 turn-id。

source: Language
zh_hant: 語系

source: Language changes take effect immediately and are saved automatically.
zh_hant: 語系切換立即生效，並自動儲存。

source: Last notification: %@
zh_hant: 最後收到通知：%@

source: Light Colors
zh_hant: 燈號顏色

source: Lights
zh_hant: 燈號

source: Loading…
zh_hant: 讀取中…

source: Manage the paired AIBox or choose another device.
zh_hant: 管理目前配對的 AIBox，或選擇另一台裝置。

source: Nearby AIBox devices
zh_hant: 附近的 AIBox

source: No acknowledgment from AIBox. Make sure the app is running.
zh_hant: 未收到 AIBox 確認，請確認 App 正在執行。

source: No devices found
zh_hant: 尚未找到裝置

source: No notifications
zh_hant: 尚無通知

source: No notifications received yet.
zh_hant: 尚未收到通知。

source: No remembered device
zh_hant: 尚未記住裝置

source: Not configured
zh_hant: 未設定

source: Not connected
zh_hant: 尚未連線

source: Notification transfer failed.
zh_hant: 通知傳輸失敗。

source: Notifications
zh_hant: 通知

source: Open Bluetooth Settings
zh_hant: 開啟藍牙設定

source: Open notifications by shaking. This does not affect shaking for 2 seconds at startup to reset pairing.
zh_hant: 控制晃動開啟通知；不影響開機搖晃 2 秒重新配對。

source: Open notifications with sudden sounds such as clapping.
zh_hant: 控制拍手等突發聲音開啟通知。

source: Permission request
zh_hant: 授權請求

source: Permission request light
zh_hant: 授權請求燈號

source: Quit
zh_hant: 結束

source: Reading Codex settings…
zh_hant: 正在讀取 Codex 設定…

source: Receive PermissionRequest notifications
zh_hant: 接收 PermissionRequest（授權請求通知）

source: Receive question and option prompts
zh_hant: 接收問答提醒（等待回答／選擇方案）

source: Receive response stop, permission and question alerts from one SSH host. Your Mac must remain online.
zh_hant: 接收一台 SSH 主機的回覆停止、授權請求及問答提醒。Mac 必須保持在線。

source: Recent notifications (up to 20)
zh_hant: 最近通知（最多 20 筆）

source: Reconnect
zh_hant: 重新連線

source: Red
zh_hant: 紅色

source: Remembered AIBox not found. Check its power and reconnect.
zh_hant: 找不到已記住的 AIBox；請確認供電，再重新連線。

source: Remembered: %@. Replaced only after confirming the new device's color.
zh_hant: 已記住：%@；選對新裝置的顏色後才會更換。

source: Remote
zh_hant: 遠端

source: Remote SSH host
zh_hant: 遠端 SSH 主機

source: Reset time
zh_hant: 重置時間

source: Reset time unknown
zh_hant: 重置時間未知

source: Resetting soon
zh_hant: 即將重置

source: Response finished
zh_hant: 回覆已結束

source: Response stop light
zh_hant: 回覆停止燈號

source: Response stop notifications are received automatically. Toggle other alerts individually and view the latest 20 notifications in the menu bar.
zh_hant: 回覆停止通知會自動接收。其他提醒可個別開關，最近 20 筆通知可從選單列查看。

source: Response stop: %@ Permission requests: %@ Questions: %@ Setup status does not confirm notification delivery.
zh_hant: 回覆停止：%@ 授權請求：%@ 問答提醒：%@ 設定狀態不代表已收到通知。

source: Response stopped
zh_hant: 回覆停止

source: SSH host alias, e.g. srv
zh_hant: SSH 主機別名，例如 srv

source: Save and Connect
zh_hant: 儲存並連線

source: Saving hook trust confirmation…
zh_hant: 正在記錄此 Hook 的信任確認…

source: Search Again
zh_hant: 重新搜尋

source: Select a device, then click Identify.
zh_hant: 請先選擇裝置，再按「辨識這台」。

source: Send Codex response and question alerts to AIBox.
zh_hant: 將 Codex 的回覆與詢問提醒傳到 AIBox。

source: Sensors
zh_hant: 感應

source: Set Up Codex
zh_hant: 設定 Codex

source: Set idle and alert colors. Lights reflect the latest unopened notification; questions use the permission request colors.
zh_hant: 設定待機與提醒的顏色。燈號對應最新尚未開啟的通知；等待回答沿用授權請求燈色。

source: Setting up response stop, permission and question alerts…
zh_hant: 正在設定回覆停止、授權請求與問答提醒…

source: Settings are overridden by another level. Hook activation is incomplete.
zh_hant: 設定被其他層級覆蓋，尚未完成 Hook 啟用。

source: Settings…
zh_hant: 設定…

source: Show each color for 0.1–10 seconds for response stop and permission alerts.
zh_hant: 每個顏色顯示 0.1～10 秒，適用於回覆停止與授權請求。

source: Sound Adjustment
zh_hant: 收音調整

source: Sound detection is off
zh_hant: 聲音偵測已關閉

source: Sound sensitivity
zh_hant: 收音敏感度

source: Start AIBox first (connect)
zh_hant: 請先啟動 AIBox（connect）

source: Steady
zh_hant: 恆亮

source: The device did not return service information.
zh_hant: 裝置未回覆服務資訊。

source: The notification socket path is occupied by another file.
zh_hant: 通知通道的位置已被其他檔案占用。

source: The remote host returned an invalid notification path.
zh_hant: 遠端傳回的通知路徑無效。

source: The white thumb sets the threshold; the fill shows the current level. The color changes as you cross the level, so you can adjust while listening.
zh_hant: 白色拉桿是設定位置，填色是目前音量。拖過音量交界時立即變色，方便邊聽邊調整。

source: This Mac does not support BLE
zh_hant: 此 Mac 不支援 BLE

source: This box is paired with another host. Unpair it first or shake continuously for 2 seconds after powering on.
zh_hant: 這台 box 已綁定其他主機；請先解除配對，或開機後持續搖晃 2 秒。

source: This event is not a conversation notification supported by AIBox.
zh_hant: 此事件不是 AIBox 支援的對話通知。

source: This notification has no conversation ID to open.
zh_hant: 此通知缺少可開啟的對話 ID。

source: Threshold %@
zh_hant: 設定 %@

source: Threshold %@, %@
zh_hant: 設定 %@，%@

source: Trust and Enable
zh_hant: 信任並啟用

source: Trust and enable AIBox conversation notification hooks?
zh_hant: 信任並啟用 AIBox 對話通知 Hook？

source: Unknown error
zh_hant: 未知錯誤

source: Unpair
zh_hant: 解除配對

source: Untrusted notification hooks were not enabled. Previously enabled hooks are unchanged.
zh_hant: 尚未信任的通知 Hook 未啟用；原本已啟用的 Hook 不受影響。

source: Uses your SSH keys and trusted hosts. Installs the remote notification script on connection, retries after disconnection, and reconnects when AIBox starts. Requires Python 3. For first use, configure and trust the hook in remote Codex using the command below. Reopen the remote conversation after setup.
zh_hant: 沿用 SSH 金鑰及已信任的主機。連線時安裝遠端通知腳本，斷線後自動重試；下次開啟 AIBox 會恢復連線。需 Python 3。 首次使用還需在遠端 Codex 設定並信任 Hook，指令如下。完成設定後請重新開啟遠端對話。

source: Waiting for box confirmation…
zh_hant: 正在等待 box 確認…

source: Waiting for sound…
zh_hant: 等待收音…

source: Weekly TOKEN usage
zh_hant: 周 TOKEN 用量

source: When disabled, new question prompts will not be added or change the light. Existing notifications and raw logs are retained.
zh_hant: 關閉後不新增問答提醒或切換燈號；既有清單及原始通知紀錄保留。

source: Which color is the box flashing?
zh_hant: 你看到 box 閃爍哪個顏色？

source: aibox-notify was not found in the app. Rebuild AIBox.
zh_hant: 找不到 App 內的 aibox-notify，請重新建置 AIBox。

source: box could not generate an identification color. Identify again.
zh_hant: box 無法產生辨識顏色，請重新辨識。

source: box could not save pairing. Reconnect and try again.
zh_hant: box 無法儲存配對，請重新連線後重試。

source: box: %@ Reconnecting in 3 seconds…
zh_hant: box：%@ 3 秒後自動重連…

source: box: Color confirmation required; displaying identification color…
zh_hant: box：需要確認燈色，正在讓 box 顯示顏色…

source: box: Color mismatch; device not saved. Identify again or choose another device.
zh_hant: box：顏色不符，尚未記住；請重新辨識或選擇另一台。

source: box: Connected
zh_hant: box：已連線

source: box: Connecting…
zh_hant: box：連線中…

source: box: Establishing encrypted Bluetooth connection. Allow pairing if prompted.
zh_hant: box：建立藍牙加密連線；若系統要求配對，請允許。

source: box: Mac Bluetooth is off
zh_hant: box：Mac 藍牙已關閉

source: box: No device found. Check its power and search again.
zh_hant: box：找不到裝置，請確認供電後重新搜尋。

source: box: No device selected. Use Choose / Change Device in Settings.
zh_hant: box：尚未選擇，請到設定按「選擇／更換 box…」

source: box: Not connected
zh_hant: box：尚未連線

source: box: Observe the flashing color on the physical box and select it in the window.
zh_hant: box：請看實體 box 閃爍的顏色，並在視窗中選擇。

source: box: Pairing confirmed; syncing lights…
zh_hant: box：已確認配對，正在同步燈號…

source: box: Searching for nearby devices…
zh_hant: box：搜尋附近裝置中…

source: box: Searching for remembered device…
zh_hant: box：搜尋已記住的裝置中…

source: box: Select a device, then click Identify.
zh_hant: box：請選擇裝置，再按「辨識這台」。

source: box: Showing identification color again…
zh_hant: box：正在重新顯示辨識顏色…

source: box: Switching connections…
zh_hant: box：正在切換連線…

source: box: Unpaired; ready to pair with another host.
zh_hant: box：已解除配對，可由其他主機重新配對。

source: box: Unpairing…
zh_hant: box：正在解除配對…

source: box: Verifying device…
zh_hant: box：確認裝置中…

source: box: Waiting for Bluetooth…
zh_hant: box：等待藍牙就緒…

source: box: Waiting for color confirmation and pairing to be saved…
zh_hant: box：等待 box 確認顏色並儲存配對…

source: box: Waiting for remembered AIBox; it will connect automatically when powered on…
zh_hant: box：等待已記住的 AIBox 上線，開機後會自動連線…

source: macOS could not open the Codex conversation. Make sure Codex App is installed.
zh_hant: macOS 無法開啟 Codex 對話，請確認 Codex App 已安裝。

source: macOS could not open the Codex conversation. This notification remains unopened.
zh_hant: macOS 無法開啟 Codex 對話；此通知仍保留為待開啟。
